app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->orderBy('artikel.id', 'DESC'); // tambah baris ini


        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new \App\Models\KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---

        // Jika GET, tampilkan form tambah
        $data['title'] = 'Tambah Artikel';
        $data['kategori'] = $kategoriModel->findAll();

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
---
    public function admin_json()
    {
        $model = new ArtikelModel();
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->orderBy('artikel.id', 'DESC');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->get()->getResultArray();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '11'
---
    public function edit($id)
    {
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();
        $artikel = $model->find($id);

SELECT *
FROM `kategori`
---

        // Jika GET
        $data['artikel'] = $artikel;
        $data['kategori'] = $kategoriModel->findAll();

DELETE FROM `artikel`
WHERE `id` IN ('11')
---
    public function delete($id)
    {
        (new ArtikelModel())->delete($id);

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `slug` = 'video-demonstrasi'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->where('slug', $slug)
            ->select('artikel.*, kategori.nama_kategori')
            ->first();

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id` = '11'
 LIMIT 1
---
    public function admin_detail($id)
{
    $model = new \App\Models\ArtikelModel();

    $artikel = $model->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
                     ->select('artikel.*, kategori.nama_kategori')
                     ->where('artikel.id', $id)
                     ->first();