app/Controllers/Post.php

SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1
---
    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();

INSERT INTO `artikel` (`judul`, `isi`, `status`) VALUES ('senjata', '', 0)
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
            'status' => $this->request->getVar('status')
        ];
        $model->insert($data);

SELECT *
FROM `artikel`
WHERE `id` = '12'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('12')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
        if ($data) {
            $model->delete($id);